In [89]:
#Pyspark DataFrames
!pip install pyspark

Requirement already satisfied: pyspark in c:\users\vaibhav warade\anaconda3\lib\site-packages (3.5.0)
Requirement already satisfied: py4j==0.10.9.7 in c:\users\vaibhav warade\anaconda3\lib\site-packages (from pyspark) (0.10.9.7)

In [1]:
import pyspark

In [2]:
from  pyspark.sql import SparkSession

In [3]:
spark = SparkSession.builder.appName("Pysparktut").getOrCreate()

In [10]:
spark

In [13]:
#df_test_dataset = spark.read.csv("test1.csv").show()

+---------+---+----------+------+
|      _c0|_c1|       _c2|   _c3|
+---------+---+----------+------+
|     Name|age|Experience|Salary|
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

# Reading file with hedaer as true
df_test = spark.read.option("header","true").csv("test1.csv")

In [22]:
#show datatypes (schema) 
df_test.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: string (nullable = true)
 |-- Experience: string (nullable = true)
 |-- Salary: string (nullable = true)

In [23]:
df_test.show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [18]:
df_test.head(1) #SHOWS ROW FROM BRACKET INDEX

[Row(Name='Krish', age='31', Experience='10', Salary='30000')]

In [69]:
#using inferschema [auto recognize datatype]
df_infered_test=spark.read.csv('test1.csv',inferSchema=True,header=True)

In [41]:
df_infered_test.printSchema()
#check datatype of columns

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [40]:
type(df_infered_test)
#Dataframe is kind of datastructure

pyspark.sql.dataframe.DataFrame

In [70]:
df_py=df_infered_test

### Select particular columns
#df_py.select('Name') -> returns o/p as DataFrame
df_py.select('Name').show()

In [57]:
df_py.select(['Name','Experience']).show()
#Selecting multiple columns

+---------+----------+
|     Name|Experience|
+---------+----------+
|    Krish|        10|
|Sudhanshu|         8|
|    Sunny|         4|
|     Paul|         3|
|   Harsha|         1|
|  Shubham|         2|
+---------+----------+

In [61]:
df_py.describe()

DataFrame[summary: string, Name: string, age: string, Experience: string, Salary: string]

### Adding columns -> withColumn
#NOTE : in order to get reflected you will have to assign it to another DF
df_py.withColumn('Experience after 2 years',df_py['Experience']+2).show()

In [71]:

df_pyNew= df_py.withColumn('Experience after 2 years',df_py['Experience']+2)

### Dropping columns
#NOTE this is also not inplace operation
df_pyNew.drop('Experince after 2 years')

In [73]:
df_removed=df_pyNew.drop('Experince after 2 years')

In [76]:
#Rename columns
#NOTE : Renamed - > check note for ed word here
df_py.withColumnRenamed('Name','FirstName').show()

+---------+---+----------+------+
|FirstName|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

## NULL value handling

In [82]:
from pyspark.sql import SparkSession
spark=SparkSession.builder.appName('Filtering session').getOrCreate()

In [87]:
df_test2=spark.read.csv('test2.csv',header=True,inferSchema=True)

In [96]:
df_test2.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

### Drop specific rows with NULL Values
#drop(how,thresh,subset)
df_test2.na.drop().show() 

#'any' by default
#Wherever null value is present , it will drop all those rows

In [99]:
#any= how
df_test2.na.drop('all').show()
#'all' drops only when all values in row is NULL

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [102]:
## threshold in na.drop
df_test2.na.drop(how='any',thresh=2).show()

#threshold = 2 checks atleast 2 NON NULL values, 
             #if there it will keep it there else drop.

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
+---------+----+----------+------+

In [103]:
## subset in na.drop
df_test2.na.drop(how='any',subset=['Experience']).show()

#Subset allows to select specific column to choose na.drop application.

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|     NULL| 34|        10| 38000|
+---------+---+----------+------+

In [109]:
## Filling the missing values 
#fill(value,subset)
df_test2.na.fill(0,['Experience']).show()
df_test2.na.fill(0,['Experience','age']).show()


# NOTE: this fill will check datatype and allow similar datatype fill only.

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|         0| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|         0|  NULL|
+---------+----+----------+------+

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|   Mahesh|  0|         0| 40000|
|     NULL| 34|        10| 38000|
|     NULL| 36|         0|  NULL|
+---------+---+----------+------+

## FILTERING

In [4]:
spark

In [8]:
df_py=spark.read.csv('test1.csv',inferSchema=True,header=True)

In [9]:
df_py.show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [14]:
df_py.filter('Experience>3').select(['Name','Salary']).show()

+---------+------+
|     Name|Salary|
+---------+------+
|    Krish| 30000|
|Sudhanshu| 25000|
|    Sunny| 20000|
+---------+------+

In [24]:
df_py.filter('Age>25' and 'Experience>4').select(['Name']).show()
#
#Same for OR filtering

#Another way of doing same
df_py.filter((df_py['Age']>25) & (df_py['Experience']>4)).select('Name').show()
#Without select name you'll get all columns

+---------+
|     Name|
+---------+
|    Krish|
|Sudhanshu|
+---------+

+---------+
|     Name|
+---------+
|    Krish|
|Sudhanshu|
+---------+

In [41]:
#NOT(negation) filtering

df_py.filter(~(df_py['Experience']>4)).show()
spark.stop()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
|  Sunny| 29|         4| 20000|
|   Paul| 24|         3| 20000|
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

## Group BY and Aggregate Functions

In [42]:
#Creating new session just for repractice
from pyspark.sql import SparkSession

In [43]:
spark=SparkSession.builder.appName('GroupNAgg').getOrCreate()

In [44]:
df_agg=spark.read.csv('test3.csv',header=True,inferSchema=True)

In [45]:
df_agg.show()

+---------+------------+------+
|     Name| Departments|salary|
+---------+------------+------+
|    Krish|Data Science| 10000|
|    Krish|         IOT|  5000|
|   Mahesh|    Big Data|  4000|
|    Krish|    Big Data|  4000|
|   Mahesh|Data Science|  3000|
|Sudhanshu|Data Science| 20000|
|Sudhanshu|         IOT| 10000|
|Sudhanshu|    Big Data|  5000|
|    Sunny|Data Science| 10000|
|    Sunny|    Big Data|  2000|
+---------+------------+------+

In [50]:
## GroupBY Name
# We cannot apply sum on string, so only salary will get summed

#Grouped to find maximum salary
df_agg.groupBy('Name').sum().show()

+---------+-----------+
|     Name|sum(salary)|
+---------+-----------+
|Sudhanshu|      35000|
|    Sunny|      12000|
|    Krish|      19000|
|   Mahesh|       7000|
+---------+-----------+

In [53]:
## Group BY department which gives maximum salary

df_agg.groupBy('Departments').sum().show()

df_agg.groupBy('Departments').mean().show()

+------------+-----------+
| Departments|sum(salary)|
+------------+-----------+
|         IOT|      15000|
|    Big Data|      15000|
|Data Science|      43000|
+------------+-----------+

+------------+-----------+
| Departments|avg(salary)|
+------------+-----------+
|         IOT|     7500.0|
|    Big Data|     3750.0|
|Data Science|    10750.0|
+------------+-----------+

In [54]:
#Number of employees per department
df_agg.groupBy('Departments').count().show()

+------------+-----+
| Departments|count|
+------------+-----+
|         IOT|    2|
|    Big Data|    4|
|Data Science|    4|
+------------+-----+

### Direct aggregate function agg({key,value})

df_agg.agg({'salary':'sum'}).show()

In [64]:
#max

df_agg.groupBy('Name').max().show()

+---------+-----------+
|     Name|max(salary)|
+---------+-----------+
|Sudhanshu|      20000|
|    Sunny|      10000|
|    Krish|      10000|
|   Mahesh|       4000|
+---------+-----------+

In [65]:
#Avg

df_agg.groupBy('Name').mean().show()

+---------+------------------+
|     Name|       avg(salary)|
+---------+------------------+
|Sudhanshu|11666.666666666666|
|    Sunny|            6000.0|
|    Krish| 6333.333333333333|
|   Mahesh|            3500.0|
+---------+------------------+